public class Main {

    /**
     * В целом - да, адаптеры неплохи, но очень громоздки, по-сути один сплошной алгоритм, если четно, то я очень долго
     * пытался переиспользовать код для сабтаска и эпика, чтобы избежать повтора, но каждый раз мне казалось, что
     * стало еще менее читаемо и понятно куда вносить изменения в случае появления новых полей.
     *
     * Для удобного запуска тестов необходимо использовать TestLauncher, в конце запуска он покажет статистику.
     * Если порты 8080, 8078 заняты или не доступны по другим причинам, их можно поменять в конфигурационном файле
     * config.properties.
     */
    public static void main(String... args) {

    }
}
