public class Main {

    public static void main(String... args) {
        /**Спасибо за совет прочитать книгу "Чистый код", очень понравилась, за первые 2 дня пол книжки прочитал. Сейчас
        *купил чистую архитектуру, но пока она до меня доехала, взялся читать другую.
        *По поводу задания: Фактически entity все переписаны на 50%, InMemoryTaskManager целиком. В FileBackedTasksManager
        *теперь путь для сохранения задается в properties, тесты запускаются от одной кнопки. Добавил еще свое исключение,
        *т.к. показалось намного проще получать исключения и исправлять логику программы в проблемном месте.
        *Добавил свой TimeIntervalList, т.к. не хотел реализовать общий случай по времени и достичь сложности алгоритма
        *поиска хотя бы О(log n).
        *Все тесты можно запустить с помощью TestLauncher.*/
    }
}
